In [29]:
import pandas as pd
import numpy as np

In [30]:
obj = pd.Series([10, 20, 30, 40, 50])
obj

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [31]:
print("Values: " + str(obj.values))
print("Index: " + str(obj.index))

Values: [10 20 30 40 50]
Index: RangeIndex(start=0, stop=5, step=1)

In [32]:
obj2 = pd.Series([25, 18, 15, 10], index=["first", "second", "third", "fourth"])
obj2

first     25
second    18
third     15
fourth    10
dtype: int64

In [33]:
print("Values: " + str(obj2.values))
print("Index: " + str(obj2.index))
print(obj2['second'])
obj2['second'] = 19
obj2['second']

Values: [25 18 15 10]
Index: Index(['first', 'second', 'third', 'fourth'], dtype='object')
18

19

In [34]:
obj2[obj2 > 15]
'first' in obj2
'last' in obj2

False

In [35]:
data = {'Ohio':35000, 'Texas':71000, 'Oregon':16000}
obj3 = pd.Series(data)
obj3

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [36]:
states = ["California", "Texas", "Oregon"]
obj4 = pd.Series(data, index=states)
obj4

California        NaN
Texas         71000.0
Oregon        16000.0
dtype: float64

In [37]:
obj4.isnull()

California     True
Texas         False
Oregon        False
dtype: bool

In [38]:
obj3 + obj4

California         NaN
Ohio               NaN
Oregon         32000.0
Texas         142000.0
dtype: float64

In [39]:
data = {'state': ['Ohio', 'Texas', 'Nevada'],
        'year': [2000, 2001, 2002],
        'pop': [1.6, 2.0, 3.0]}

dataFrame = pd.DataFrame(data, columns=['year', 'pop', 'state', 'debt'],
                         index=['one', 'two', 'three'])
dataFrame

       year  pop   state debt
one    2000  1.6    Ohio  NaN
two    2001  2.0   Texas  NaN
three  2002  3.0  Nevada  NaN

In [40]:
stateSeries = dataFrame['state']
stateSeries

one        Ohio
two       Texas
three    Nevada
Name: state, dtype: object

In [42]:
dataFrame['debt'] = np.arange(3)
dataFrame

       year  pop   state  debt
one    2000  1.6    Ohio     0
two    2001  2.0   Texas     1
three  2002  3.0  Nevada     2

In [43]:
dataFrame['eastern'] = dataFrame.state == 'Ohio'
dataFrame

       year  pop   state  debt  eastern
one    2000  1.6    Ohio     0     True
two    2001  2.0   Texas     1    False
three  2002  3.0  Nevada     2    False

In [44]:
dataFrame.values

array([[2000, 1.6, 'Ohio', 0, True],
       [2001, 2.0, 'Texas', 1, False],
       [2002, 3.0, 'Nevada', 2, False]], dtype=object)